Билет11/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ТоварыОтгружены</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыПриняты</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументуОтгружено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументуПринято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет11/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.СуммаОтгружено = СтрокаТЧ.КоличествоОтгружено * СтрокаТЧ.Цена;
	СтрокаТЧ.СуммаПринято = СтрокаТЧ.КоличествоПринято * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.СуммаОтгружено = СтрокаТЧ.КоличествоОтгружено * СтрокаТЧ.Цена;
    
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПринятоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.СуммаПринято = СтрокаТЧ.КоличествоПринято * СтрокаТЧ.Цена;
КонецПроцедуры
